web-dev/jekyll-Note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-16 Thu 11:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>jekyll</title>
<meta name="author" content="Karthik" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">jekyll</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org55392b8">Intro</a></li>
<li><a href="#org9d225d5">Install jekyll and bundler germs</a></li>
<li><a href="#orgb07fff3">Create a new Jekyll site at ./myblog</a></li>
<li><a href="#orga85255f">Front matter</a></li>
<li><a href="#org276e8ef">Create your 1st post in _posts</a></li>
<li><a href="#org14fc4a0">Draft</a></li>
<li><a href="#org977606a">Pages</a></li>
<li><a href="#org1dba22c">Permalinks: Permanetent links</a></li>
<li><a href="#org3f41b45">Front Matter Default</a></li>
<li><a href="#orgc727fe3">Install theme in jeklly</a></li>
<li><a href="#org52b0db4">Layout</a></li>
<li><a href="#orge4793b4">Variable in jekyll</a></li>
<li><a href="#orge15b179">Include</a></li>
<li><a href="#orgeba9dea">Looping</a></li>
<li><a href="#org9c8c8f9">Conditions</a></li>
<li><a href="#orgbae4fdf">Data Files</a></li>
<li><a href="#org08a224c">Create a complex website</a></li>
<li><a href="#org20abd2b">Create a theme for jekyll</a></li>
</ul>
</div>
</div>
<p>
<a href="https://www.youtube.com/playlist?list=PLLAZ4kZ9dFpOPV5C5Ay0pHaa0RJFhcmcB">https://www.youtube.com/playlist?list=PLLAZ4kZ9dFpOPV5C5Ay0pHaa0RJFhcmcB</a>
</p>
<div id="outline-container-org55392b8" class="outline-2">
<h2 id="org55392b8">Intro</h2>
<div class="outline-text-2" id="text-org55392b8">
<ul class="org-ul">
<li>Jeklly is a markdown based blog or website creation without using html or css or js</li>
<li>Jeklly theme is github theme and it is dynamic (auto-size adjusted) means it can be used in mobile, tablet , pc &#x2026; contant will auto adjusted</li>
<li>Big Community</li>
</ul>
<pre class="example">
# https://phoenixnap.com/kb/install-ruby-ubuntu
sudo apt update
sudo apt install ruby-full
ruby --version
sudo apt install gem

# install g++ 
sudo apt install g++
sudo apt-get install build-essential 
</pre>
</div>
</div>
<div id="outline-container-org9d225d5" class="outline-2">
<h2 id="org9d225d5">Install jekyll and bundler germs</h2>
<div class="outline-text-2" id="text-org9d225d5">
<pre class="example">
# Prerequisites 
# - Ruby version 2.5.0 or higher   # ruby -v 
# - RubyGems                       # gem -v
# - GCC and Make

gem install jekyll bundler
</pre>
</div>
</div>

<div id="outline-container-orgb07fff3" class="outline-2">
<h2 id="orgb07fff3">Create a new Jekyll site at ./myblog</h2>
<div class="outline-text-2" id="text-orgb07fff3">
<pre class="example">
jekyll new myblog
cd myblog
blundle exec jekyll serve # Browse to http://localhost:4000
# you can use only jekyll serve after build 
#jekyll serve

</pre>
</div>
</div>


<div id="outline-container-orga85255f" class="outline-2">
<h2 id="orga85255f">Front matter</h2>
<div class="outline-text-2" id="text-orga85255f">
<pre class="example">
cat myblog/_post/2022-07-30-welcome-to-jekyll.markdown
</pre>

<p>
The metadata present before body in markdown is know as Front-Matter
</p>
<div class="org-src-container">
<pre class="src src-markdown">---
layout: post
title:  "Welcome to Jekyll!"
date:   2022-07-30 21:19:45 +0530
categories: jekyll update
author: Mike
---
You’ll find this post in your `_posts` directory. Go ahead and edit it and re-build the site to see your changes. You can rebuild the site in many different ways, but the most common way is to run `jekyll serve`, which launches a web server and auto-regenerates your site when a file is updated.

Jekyll requires blog post files to be named according to the following format:

`YEAR-MONTH-DAY-title.MARKUP`

Where `YEAR` is a four-digit number, `MONTH` and `DAY` are both two-digit numbers, and `MARKUP` is the file extension representing the format used in the file. After that, include the necessary front matter. Take a look at the source for this post to get an idea about how it works.

Jekyll also offers powerful support for code snippets:

</pre>
</div>

<p>
You can create own front-matter and use them in your <code>jeklly layout</code> or <code>custome html</code> ..etc
</p>
</div>
</div>

<div id="outline-container-org276e8ef" class="outline-2">
<h2 id="org276e8ef">Create your 1st post in _posts</h2>
<div class="outline-text-2" id="text-org276e8ef">
<p>
Name of post must contain <code>Date</code> before filename
</p>

<p>
create a markdown file in myblog/<sub>posts</sub> name it <code>2017-09-24-my-frist-post</code>
</p>

<p>
The <code>Front Matter</code> for post is
</p>

<div class="org-src-container">
<pre class="src src-markdown">---
layout: "post"
title: "This is the new title"
date: 2017-09-24 15:58:59 +0530
---
Some Conten
</pre>
</div>


<blockquote>
<p>
you can organize post in a dir by creating a directory inside <code>_posts</code> jekyll will able to identity the file 
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org14fc4a0" class="outline-2">
<h2 id="org14fc4a0">Draft</h2>
<div class="outline-text-2" id="text-org14fc4a0">
<p>
Dir <code>cd myblog/_draft</code> is used to store unfinished post
</p>
<ul class="org-ul">
<li>generally <code>_draft</code> are not displaced in localhost <code>localserver</code></li>
<li><p>
to dispaly the drafts
</p>
<div class="org-src-container">
<pre class="src src-sh">jekyll serve --draft
</pre>
</div></li>
</ul>
</div>
</div>


<div id="outline-container-org977606a" class="outline-2">
<h2 id="org977606a">Pages</h2>
<div class="outline-text-2" id="text-org977606a">
<p>
web page like : about, contat, donation,
</p>

<p>
Create donation page
</p>

<pre class="example">
cd myblog
touch donate.md
cat donate.md
</pre>

<pre class="example">
---
layout: "page"
---
Donate to our site 
</pre>

<p>
To view page : <code>localhost:4000/donate</code>
</p>

<p>
You can organize page by grouing them in directory <code>myblog/page-dir</code>
</p>
</div>
</div>

<div id="outline-container-org1dba22c" class="outline-2">
<h2 id="org1dba22c">Permalinks: Permanetent links</h2>
<div class="outline-text-2" id="text-org1dba22c">
<p>
the url of post changes if the date changes so we can use permalinks which doesn't changes with date
</p>

<p>
<code>permalink: "my-new-url-test/test2"</code>
</p>

<div class="org-src-container">
<pre class="src src-markdown">---
layout: "post"
title: "This is the new title"
date: 2017-09-24 15:58:59 +0530
permalink: "my-new-url-test/test2"
---
Some Conten
</pre>
</div>


<p>
or we can use categories
</p>
<div class="org-src-container">
<pre class="src src-markdown">---
layout: "post"
title: "This is the new title"
date: 2017-09-24 15:58:59 +0530
categories: jekyll new-cat
permalink: /:categories/:day/:year/:month/:title.html 
---
Some Conten
</pre>
</div>
</div>
</div>
<div id="outline-container-org3f41b45" class="outline-2">
<h2 id="org3f41b45">Front Matter Default</h2>
<div class="outline-text-2" id="text-org3f41b45">
<p>
If you want  author in every blog post then we can configure in post or we can configure in yaml file <code>config.yml</code> 
</p>

<div class="org-src-container">
<pre class="src src-markdown">---
layout: "post"
title: "This is the new title"
date: 2017-09-24 15:58:59 +0530
author: "Deepalgorithms"
---
Some Conten
</pre>
</div>

<p>
config.yml 
</p>
<div class="org-src-container">
<pre class="src src-yaml"># cat config.yml 
defaults:
  -
    scope: 
      path: ""
    values:
      layout: "post"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc727fe3" class="outline-2">
<h2 id="orgc727fe3">Install theme in jeklly</h2>
<div class="outline-text-2" id="text-orgc727fe3">
<p>
Jeklly come with <code>minima</code> theme
</p>

<p>
There are many theme in jeklly you can select from <a href="https://rubygems.org/search?query=jekyll-theme">https://rubygems.org/search?query=jekyll-theme</a>
</p>

<p>
You can see the preview by going to  Links: homepage &gt; github &gt; preview
</p>

<p>
You can install theme in Gemfile
</p>

<div class="org-src-container">
<pre class="src src-gem">gem "minima", "~&gt; 2.5"
gem "jekyll-theme-hacker"
</pre>
</div>


<pre class="example">
# close the serve  and install theme
bundle install  # this will install theme
bundle exec jekyll serve # restart server 
</pre>

<p>
Config theme in <code>config.yml</code>
</p>
</div>
</div>

<div id="outline-container-org52b0db4" class="outline-2">
<h2 id="org52b0db4">Layout</h2>
<div class="outline-text-2" id="text-org52b0db4">
<p>
Layout is basic selection of html and css used to create a site 
There are two layouts
</p>
<ul class="org-ul">
<li>post</li>
<li><p>
page
</p>

<p>
You can create your own layout by
</p>
<div class="org-src-container">
<pre class="src src-sh">cd myblog
mkdir _layout  # html
touch _layout/post.html
</pre>
</div>

<p>
You can create your own post like
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;h1&gt; This is post &lt;/h1&gt;

&lt;hr&gt;

{{ content }}

</pre>
</div></li>
</ul>

<p>
You can create custome page layout by myblog/<sub>layout</sub>/page.html
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;h1&gt; This is page  &lt;/h1&gt;

&lt;hr&gt;

{{ content }}

</pre>
</div>


<p>
You can define custome layout  myblog/<sub>layout</sub>/giraffe.html
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;h1&gt; This is page  &lt;/h1&gt;

&lt;hr&gt;

{{ content }}
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4793b4" class="outline-2">
<h2 id="orge4793b4">Variable in jekyll</h2>
<div class="outline-text-2" id="text-orge4793b4">
<div class="org-src-container">
<pre class="src src-markdown">---
layout: "post"
title: "This is the new title"
date: 2017-09-24 15:58:59 +0530
author: "Deepalgorithms"
---

Some Content

afadfadf

&lt;h1&gt; This is post &lt;/h1&gt;
&lt;h2&gt; {{ post.title }} &lt;/h2&gt;
&lt;h3&gt; {{ layout.author }} &lt;/h3&gt;


</pre>
</div>

<p>
For more variables visit <a href="https://jekyllrb.com/docs/variables/">https://jekyllrb.com/docs/variables/</a>
</p>
</div>
</div>
<div id="outline-container-orge15b179" class="outline-2">
<h2 id="orge15b179">Include</h2>
<div class="outline-text-2" id="text-orge15b179">
<p>
header and footer
</p>

<div class="org-src-container">
<pre class="src src-sh">cd myblog
mkdir _include
cd myblog/_include
touch header.html
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html"># cat header.html

&lt;h1&gt; {{site.title }} &lt;/h1&gt;
&lt;hr&gt;

</pre>
</div>

<p>
To include in page
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;html&gt;
&lt;head&gt;
  &lt;meata charset="UTF-8"
  &lt;title&gt; {{ site.title}} &lt;/title&gt;
&lt;/head&gt;

&lt;body&gt;
  {% include header.html%}
  {{ content }} 
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeba9dea" class="outline-2">
<h2 id="orgeba9dea">Looping</h2>
<div class="outline-text-2" id="text-orgeba9dea">
<p>
show all post in home page
</p>

<p>
<code>cat home.html</code>
</p>

<div class="org-src-container">
<pre class="src src-html">{% for post in site.posts %}
  &lt;li&gt; &lt;a href="{{ post.url }}" &gt; {{post.title}} &lt;/a&gt; &lt;/li&gt;f
  {{ post.title}} &lt;br&gt;

{% endfor %}

</pre>
</div>
</div>
</div>
<div id="outline-container-org9c8c8f9" class="outline-2">
<h2 id="org9c8c8f9">Conditions</h2>
<div class="outline-text-2" id="text-org9c8c8f9">
<div class="org-src-container">
<pre class="src src-html">
{% if page.title == "My Frist Post" and "Last Post" %}
  This is the first post
{% elsfi page.title == "My Second Post" or "Last Send Post" %}
  This is the second post
{% else %}
   This is another post 
{% endif %}

</pre>
</div>
</div>
</div>
<div id="outline-container-orgbae4fdf" class="outline-2">
<h2 id="orgbae4fdf">Data Files</h2>
<div class="outline-text-2" id="text-orgbae4fdf">
<p>
access json yaml csv and dispaly on website
</p>

<div class="org-src-container">
<pre class="src src-sh"># create data file yaml
touch people.yml
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yaml"># peopel.yaml

- name : "Mike"
  occupation: "Giraffe Academy"

- name : "Steve"
  occupation: "Firefighter"

- name : "Rob"
  occupation: "Programmer"

</pre>
</div>


<p>
inside home.html
</p>

<div class="org-src-container">
<pre class="src src-html">
{% for person in site.data.people %}
  {{person.name}}, {{ person.occupation }} &lt;br&gt; 

{% endfor %}
</pre>
</div>
</div>
</div>


<div id="outline-container-org08a224c" class="outline-2">
<h2 id="org08a224c">Create a complex website</h2>
<div class="outline-text-2" id="text-org08a224c">
<p>
<a href="https://www.youtube.com/watch?v=FiJuoFg_Ipc">https://www.youtube.com/watch?v=FiJuoFg_Ipc</a>
</p>
</div>
</div>


<div id="outline-container-org20abd2b" class="outline-2">
<h2 id="org20abd2b">Create a theme for jekyll</h2>
<div class="outline-text-2" id="text-org20abd2b">
<p>
<a href="https://www.youtube.com/watch?v=UuHrgv6p2Mg">https://www.youtube.com/watch?v=UuHrgv6p2Mg</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Karthik</p>
<p class="date">Created: 2023-03-16 Thu 11:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
